# 문자열
# - "" , '' 감싸서 표현

# 여러줄 문자열
# 형식: 삼중 따옴표 """ 적을 내용 ~ """
notice = """
설비 점검 안내
1. 전원 확인
2, 센서 점검
"""
print(notice)

# 이스케이프 : \n 줄바꿈 , \t 탭
print("이름\t상태")
print("첫줄\n둘재 줄")

print("=" * 3,"실습 1","=" * 3) # 여러 줄 문자열 만들기
print("가동 점검표\n","1. 온도 확인\n","2. 압력 확인\n","3. 진동 확인\n" )
print("가동 점검표\t","1. 온도 확인\t","2. 압력 확인\t","3. 진동 확인\t")

print("=" * 3,"실습 2","=" * 3) # 설비 라벨 이어 붙이기
code = "PUMP_A"      # 설비 코드
status = "정상"      # 상태
date = str("2025-01-15")  # 날짜
print(code + " / " + status + " / " + date)

print("=" * 3,"실습 3","=" * 3) # 설비 정보 카드 만들기
code = "pump_A"
status = "정상"
time = 130
check = "2026-10-21"
print(code + " / " + status + " / " + str(time),"시간" + " / " + check)
