# replace - 바꾸기 / 지우기
# 형식 : 문자열.replace ('바꿀것' , '새것')
# - 모두 바꾸기 , 결과 저장 필요

print('정 상 가 동' . replace(' ',''))    # 정상가동
print('010-3325-5809' . replace('-','')) # 01033255809
print('3,000' . replace(',',''))          #3000

# 체이닝 활용 가능 -> 여러 종류 문자 대체 차례대로 변경

# split - 구분자로 나누기 ( 결과 -> 리스트 )
# 형식 : 문자열.split('구분자') (구분자 생략 = 공백 기준)
print('A1 A2 A3' . split())      # [A1 , A2 , A3]
print('사과,배,감' . split(','))  # ['사과', '배', '감']

print('=' * 3,'실습 1','=' * 3) # 단어 바꾸기
print('설비 정상 가동'.replace('정상','점검'))

print('=' * 3,'실습 2','=' * 3) # 공백 기준으로 나누기
print('PUMP A 03' . split())

print('=' * 3,'실습 3','=' * 3) # 쉼표 기준으로 나누기
print('a,b,c,d'.split(','))

print('=' * 3,'실습 4','=' * 3) # 나누는 횟수 제한하기
print('a,b,c,d'.split(',',1))